# DATA 540: Databases and Data Retrieval
# Lab 2: SQL

## Objectives

1. Run a MySQL database using Docker, and connect using Jupyter.
1. Write SQL queries of varying complexity on a MySQL database using SELECT. Queries will involve DISTINCT, joins, expressions/functions, GROUP BY, ORDER BY, HAVING, and subqueries.

## Getting Started

1. Ensure you have all of the requirements to run MySQL using Docker and connect using Jupyter as needed and explained in Lab 1.

1. Start the docker server by running `docker-compose up`

1. Connect your Jupyter instance by running the 2 cells below.

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql mysql+mysqldb://tpch:tpch@127.0.0.1/tpch

### Question 1 (20 marks)

The sample database is [TPC-H](http://www.tpc.org/tpch/) which is a standard database used to benchmark database systems. It is designed to be a data warehouse of information on customers, orders, and products.

The queries are generally of increasing complexity with easier queries at the start. Each question is worth 2 marks. Submit a single text file containing all the SQL SELECT statements for the queries. You do not have to provide the output but may if you wish.

1. Return the nations (**n_nationkey** and **n_name**) in region **1**. Rename fields to **id** and **name**. Note: Do not worry if SQuirreL does not rename fields in displaying table output. **(2 marks)**

In [5]:
%%sql

SELECT n_nationkey AS id,
       n_name AS name
FROM nation
WHERE n_regionkey = 1

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
5 rows affected.

[(1, 'ARGENTINA'),
 (2, 'BRAZIL'),
 (3, 'CANADA'),
 (17, 'PERU'),
 (24, 'UNITED STATES')]

2. Return the customer keys (no duplicates) that have placed at least one order after **November 25, 2018** and the total order price was between **$265,000** and **$280,000** inclusive. Sort by customer key ascending. **(2 marks)**

In [6]:
%%sql

SELECT DISTINCT o_custkey
FROM orders
WHERE o_orderdate > '2018-11-25'
  AND o_totalprice >= 265000
  AND o_totalprice <= 280000
ORDER BY o_custkey

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
8 rows affected.

[(227,), (973,), (988,), (1019,), (1045,), (1124,), (1187,), (1277,)]

3. Return the customer key, name, and account balance for customers with nation key less than **2** and account balance less than **0**. **(2 marks)**

In [7]:
%%sql

SELECT c_custkey,
       c_name,
       c_acctbal
FROM customer
JOIN nation ON c_nationkey=n_nationkey
WHERE n_nationkey < 2
  AND c_acctbal < 0

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
8 rows affected.

[(337, 'Customer#000000337', Decimal('-270.59')),
 (618, 'Customer#000000618', Decimal('-932.38')),
 (754, 'Customer#000000754', Decimal('-566.86')),
 (1430, 'Customer#000001430', Decimal('-920.40')),
 (478, 'Customer#000000478', Decimal('-210.40')),
 (647, 'Customer#000000647', Decimal('-132.97')),
 (1234, 'Customer#000001234', Decimal('-982.32')),
 (1492, 'Customer#000001492', Decimal('-875.17'))]

4. List the part name, supplier name, and nation name of the supplier for all parts where the part name contains **ivory** and the nation is either **'CANADA'** or **'FRANCE'**. Order ascending by supplier name and show first **8** rows. **(2 marks)**

In [8]:
%%sql

SELECT p_name,
       s_name,
       n_name
FROM part
JOIN partsupp ON p_partkey=ps_partkey
JOIN supplier ON ps_suppkey=s_suppkey
JOIN nation ON s_nationkey=n_nationkey
WHERE (n_name = 'CANADA'
       OR n_name = 'FRANCE')
  AND p_name like '%ivory%'
ORDER BY s_name
LIMIT 8

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
8 rows affected.

[('ivory burlywood almond lavender blue', 'Supplier#000000013', 'CANADA'),
 ('floral bisque grey ivory lawn', 'Supplier#000000013', 'CANADA'),
 ('ivory grey tomato lawn', 'Supplier#000000013', 'CANADA'),
 ('olive ivory plum medium navajo', 'Supplier#000000020', 'CANADA'),
 ('salmon linen ivory orange dim', 'Supplier#000000020', 'CANADA'),
 ('tan azure lime ivory linen', 'Supplier#000000020', 'CANADA'),
 ('violet ivory antique sky lawn', 'Supplier#000000070', 'FRANCE'),
 ('smoke ivory burlywood puff khaki', 'Supplier#000000070', 'FRANCE')]

5. List pairs of suppliers where the suppilers have the same nation and the first 5 digits of their phone numbers are the same. Show the supplier names, phone numbers, and total account balance (total of two balances). Only show each pair once. Hint: Examine string functions in MySQL, specifically [LEFT](https://dev.mysql.com/doc/refman/8.0/en/string-functions.html#function_left). **(2 marks)**

In [9]:
%%sql

SELECT S.s_name,
       S2.s_name,
       S.s_phone,
       S2.s_phone,
       S.s_acctbal+S2.s_acctbal AS totalBalance
FROM supplier S
JOIN supplier S2 ON S.s_nationkey=S2.s_nationkey
AND S.s_suppkey < S2.s_suppkey
WHERE left(S.s_phone, 6) = left(S2.s_phone, 6)

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
1 rows affected.

[('Supplier#000000019', 'Supplier#000000064', '34-278-310-2731', '34-278-790-7004', Decimal('7460.08'))]

6. Determine the number of customers, number of unique countries, total customer account balance, and average length of customer address for all customers in any of these three segments: **'BUILDING', 'AUTOMOBILE', 'MACHINERY'** and with a nation key less than **10**. **(2 marks)**

In [10]:
%%sql

SELECT count(*) AS numCustomer,
       count(DISTINCT c_nationkey) AS numCountries,
       sum(c_acctbal) AS totalBalance,
       avg(length(c_address)) AS avgLength
FROM customer
WHERE c_mktsegment in ('BUILDING',
                       'AUTOMOBILE',
                       'MACHINERY')
  AND c_nationkey < 10

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
1 rows affected.

[(376, 10, Decimal('1581637.82'), Decimal('24.8883'))]

7. For each nation name and market segment, display its number of customers, number of orders, and minimum and maximum customer account balances. Make sure to rename fields as in output. Only process customers in a nation that has a **A** in its name. Only show rows where the number of customers is greater than **10**, the number of orders is greater than **180**, and the maximum balance is **>= 9000**. Include customers even if they do not have any orders. **(2 marks)**

In [11]:
%%sql

SELECT c_mktsegment AS marketSegment,
       n_name AS nation,
       count(DISTINCT c_custkey) AS numCustomer,
       count(DISTINCT o_orderkey) AS numOrders,
       max(c_acctbal) AS maxBalance,
       min(c_acctbal) AS minBalance
FROM customer
LEFT JOIN orders ON c_custkey=o_custkey
JOIN nation ON c_nationkey=n_nationkey
WHERE n_name like '%A%'
GROUP BY c_mktsegment,
         n_name
HAVING numCustomer > 10
AND numOrders > 180
AND maxBalance >= 9000

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
7 rows affected.

[('AUTOMOBILE', 'CANADA', 19, 213, Decimal('9339.57'), Decimal('-556.05')),
 ('AUTOMOBILE', 'CHINA', 18, 184, Decimal('9750.71'), Decimal('737.40')),
 ('AUTOMOBILE', 'IRAN', 20, 268, Decimal('9180.50'), Decimal('-932.96')),
 ('BUILDING', 'ARGENTINA', 18, 197, Decimal('9768.21'), Decimal('-210.40')),
 ('BUILDING', 'SAUDI ARABIA', 15, 200, Decimal('9680.51'), Decimal('-574.39')),
 ('FURNITURE', 'IRAN', 17, 199, Decimal('9834.19'), Decimal('-588.38')),
 ('HOUSEHOLD', 'SAUDI ARABIA', 17, 187, Decimal('9777.19'), Decimal('-395.89'))]

8. Return the part key and size for all parts never shipped in a lineitem (**l_shipdate**) during the month of **May**. The part size must also be between **10** and **12** inclusive. Order the output by **size descending** then **key descending**. Hint: You will need [MONTH](https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html#function_month) function. **(2 marks)**

In [12]:
%%sql

SELECT p_partkey,
       p_size
FROM part
WHERE p_partkey not in
    (SELECT l_partkey
     FROM lineitem
     WHERE month(l_shipdate) = 5)
  AND p_size BETWEEN 10 AND 12
ORDER BY p_size DESC,
         p_partkey DESC

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
7 rows affected.

[(1347, 12),
 (1541, 11),
 (1388, 11),
 (586, 11),
 (1931, 10),
 (1837, 10),
 (668, 10)]

9. Return the customer with the largest account balance. **(2 marks)**

In [13]:
%%sql

SELECT c_name,
       c_acctbal
FROM customer
WHERE c_acctbal =
    (SELECT max(c_acctbal)
     FROM customer)

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
1 rows affected.

[('Customer#000000213', Decimal('9987.71'))]

10. Determine the total amount each product is in a lineitem using the **l_quantity** field. For example, part key 1 has total lineitem quantity of 628. Now calculate the average of these total quantities for all parts (average is about 767). Use this calculated average to return the part manufacturer and brand (as a single concatenated field) for parts that are ordered 60% more than the average quantity parts are ordered. Order by total quantity descending. Hint: Use [CONCAT](https://dev.mysql.com/doc/refman/8.0/en/string-functions.html#function_concat) function and will need several subqueries. Goal is to do this in one SQL query (with subqueries) but part marks if do it as a series of SQL queries. **(2 marks)**

In [14]:
%%sql

SELECT concat(p_mfgr, ' - ', p_brand) AS manufacturerBrand,
       p_partkey,
       totalQty
FROM
  (SELECT l_partkey,
          sum(l_quantity) AS totalQty
   FROM lineitem
   GROUP BY l_partkey) L
JOIN part ON l_partkey = p_partkey
WHERE totalQty >
    (SELECT avg(totalQty)
     FROM
       (SELECT l_partkey,
               sum(l_quantity) AS totalQty
        FROM lineitem
        GROUP BY l_partkey) L)*1.60
ORDER BY totalQty DESC

 * mysql+mysqldb://tpch:***@127.0.0.1/tpch
8 rows affected.

[('Manufacturer#3 - Brand#32', 1749, Decimal('1374.00')),
 ('Manufacturer#3 - Brand#34', 1228, Decimal('1353.00')),
 ('Manufacturer#5 - Brand#51', 1397, Decimal('1318.00')),
 ('Manufacturer#3 - Brand#34', 1393, Decimal('1278.00')),
 ('Manufacturer#2 - Brand#21', 609, Decimal('1257.00')),
 ('Manufacturer#3 - Brand#33', 1060, Decimal('1244.00')),
 ('Manufacturer#5 - Brand#52', 272, Decimal('1242.00')),
 ('Manufacturer#4 - Brand#44', 1235, Decimal('1239.00'))]